BAS BMEKZU Project/src/Documents/ИНАГРО_ПрочиеЗатраты/ИНАГРО_ПрочиеЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ПрочиеЗатраты</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ИНАГРО_ЗатратыОрганизаций</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыОперацийПрочиеЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>КоличествоГолов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Поштучный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Поштучный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДополнительный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходнойПроводки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

BAS BMEKZU Project/src/AccumulationRegisters/ИНАГРО_ЗатратыОрганизаций/ИНАГРО_ЗатратыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИНАГРО_ЗатратыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоСписания3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.БиологическиеАктивы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыОперацийПрочиеЗатраты/ИНАГРО_ВидыОперацийПрочиеЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыОперацийПрочиеЗатраты</name>
  <enumValues>
    <name>Отражение</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/НалоговыеНазначенияАктивовИЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалоговыеНазначенияАктивовИЗатрат</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>НКУ_БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслугиАморт</name>
      <description>Быт. усл. (пат.), аморт.</description>
    </items>
    <items>
      <name>БытУслугиАмортНеОблагНДС</name>
      <description>Быт. усл. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>БытУслугиНеОблагНДС</name>
      <description>Быт. усл. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнесАморт</name>
      <description>Игор. бизнес (пат.), аморт.</description>
    </items>
    <items>
      <name>ИгорБизнесАмортНеОблагНДС</name>
      <description>Игор. бизнес (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ИгорБизнесНеОблагНДС</name>
      <description>Игор. бизнес (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяХозДеятельность</name>
      <description>Необл. НДС, любая хоз.</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяНеХозДеятельность</name>
      <description>Необл. НДС, нехоз.</description>
    </items>
    <items>
      <name>НКУ_НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельностьАморт</name>
      <description>Нехоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>НеХозДеятельностьАмортНеОблагНДС</name>
      <description>Нехоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>НеХозДеятельностьНеОблагНДС</name>
      <description>Нехоз. д-сть, не обл. НДС</description>
    </items>
    <items>
      <name>НДС_Облагаемая</name>
      <description>Обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>НКУ_ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>ОбмВалютыАморт</name>
      <description>Обм. вал. (пат.), аморт.</description>
    </items>
    <items>
      <name>ОбмВалютыАмортНеОблагНДС</name>
      <description>Обм. вал. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалютыНеОблагНДС</name>
      <description>Обм. вал. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Освобожденная</name>
      <description>Освобожд. ( п. 154.6 НКУ)</description>
    </items>
    <items>
      <name>НКУ_ПрограммнаяПродукция</name>
      <description>Прогр. прод. (субъекты индустрии)</description>
    </items>
    <items>
      <name>НДС_Пропорционально</name>
      <description>Пропорц. обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Распределяемая</name>
      <description>Распределяемая</description>
    </items>
    <items>
      <name>НКУ_ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельностьАморт</name>
      <description>Торг. д-сть (пат.), аморт.</description>
    </items>
    <items>
      <name>ТоргДеятельностьАмортНеОблагНДС</name>
      <description>Торг. д-сть (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ТоргДеятельностьНеОблагНДС</name>
      <description>Торг. д-сть (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>НКУ_ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>ХозДеятельностьАморт</name>
      <description>Хоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>ХозДеятельностьАмортНеОблагНДС</name>
      <description>Хоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельностьНеОблагНДС</name>
      <description>Хоз. д-сть, не обл. НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалоговойДеятельности</name>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ВидыДеятельностиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНалоговогоНазначения</name>
    <type>
      <types>EnumRef.ГруппыНалоговыхНазначений</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Documents/ИНАГРО_ПрочиеЗатраты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мВалютаРегламентированногоУчета; 

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если  ТипДанныхЗаполнения = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ВидОперации") Тогда
		ВидОперации = ДанныеЗаполнения.ВидОперации;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УчетнаяПолитика.ПлательщикНДС(Организация, Дата) Тогда
		// Организация - не плательщик НДС. Установим во всех ТЧ признак соответствующего учета НДС.
		НеОБлНДСДеятельность = Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяХозДеятельность;
		
		Для каждого СтрокаТЧ  Из Затраты Цикл
		    СтрокаТЧ.НалоговоеНазначение = НеОБлНДСДеятельность;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаЗатрат; 
		
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);  	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	мВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
		
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента,Отказ,Заголовок);
	
	// Дополним полями, нужными для регл. и упр. учета
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначенияРед12.СформироватьДеревоПолейЗапросаПоШапке();
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// Формирование движений регистров, бухгалтерских и налоговых проводок.
	ФормированиеДвиженийРегл(СтруктураШапкиДокумента);

	Движения.Хозрасчетный.ВыполнитьДействияПередЗаписьюДвижений();
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

// Процедура определяет параметры учетной политики
//
Процедура ПодготовитьПараметрыУчетнойПолитики(СтруктураШапкиДокумента, Отказ, Заголовок)
		
	СтруктураШапкиДокумента.Вставить("ЕстьНалогНаПрибыльДо2015", УчетнаяПолитика.ПлательщикНалогаНаПрибыльДо2015(Организация, Дата));
	СтруктураШапкиДокумента.Вставить("ЕстьНДС",                  УчетнаяПолитика.ПлательщикНДС(Организация, Дата));
	
	БухгалтерскийУчет.ПроверитьЗаполнениеАналитикиЗатрат(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры 

// Процедура формирования движений регл. регистров
//
Процедура ФормированиеДвиженийРегл(СтруктураШапкиДокумента)
	
	Проводки = Движения.Хозрасчетный;
	
	СтруктДопПараметры = Новый Структура;
	СтруктДопПараметры.Вставить("ВидОперации",        СтруктураШапкиДокумента.ВидОперации);
	СтруктДопПараметры.Вставить("КурсДокумента",      1);
	СтруктДопПараметры.Вставить("КратностьДокумента", 1);
	СтруктДопПараметры.Вставить("ЕстьНДС",            Ложь);
	
	Если ВидОперации = Перечисления.ИНАГРО_ВидыОперацийПрочиеЗатраты.Списание Тогда
		СтруктДопПараметры.Вставить("ВидДвижения",   "Расход");
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из Затраты Цикл
		
		НоваяПроводка = Проводки.Добавить();
		НоваяПроводка.Активность 	= Истина;
		НоваяПроводка.Период     	= Дата;
		
		НоваяПроводка.Организация 	= Организация;
		НоваяПроводка.Содержание	= Нстр("ru='Прочие затраты';uk='Інші витрати'");
		НоваяПроводка.Сумма  		= СтрокаТабличнойЧасти.Сумма;
		
		Если ВидОперации = Перечисления.ИНАГРО_ВидыОперацийПрочиеЗатраты.Отражение Тогда
			
			НоваяПроводка.СчетДт = СтрокаТабличнойЧасти.СчетЗатрат;
			БухгалтерскийУчет.УстановитьСубконто(СтрокаТабличнойЧасти.СчетЗатрат, НоваяПроводка.СубконтоДт, 1, СтрокаТабличнойЧасти.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(СтрокаТабличнойЧасти.СчетЗатрат, НоваяПроводка.СубконтоДт, 2, СтрокаТабличнойЧасти.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(СтрокаТабличнойЧасти.СчетЗатрат, НоваяПроводка.СубконтоДт, 3, СтрокаТабличнойЧасти.Субконто3);
			
			НоваяПроводка.СчетКт = Счет;
			БухгалтерскийУчет.УстановитьСубконто(Счет, НоваяПроводка.СубконтоКт, 1, Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Счет, НоваяПроводка.СубконтоКт, 2, Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Счет, НоваяПроводка.СубконтоКт, 3, Субконто3);
						
			Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
				НоваяПроводка.НалоговоеНазначениеДт = СтрокаТабличнойЧасти.НалоговоеНазначение;
				Если НоваяПроводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
					И НоваяПроводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					НоваяПроводка.СуммаНУДт = СтрокаТабличнойЧасти.СуммаНУ;
				КонецЕсли;
			КонецЕсли;
			Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
				НоваяПроводка.НалоговоеНазначениеКт = НалоговоеНазначениеДоходовИЗатрат;
				Если НоваяПроводка.НалоговоеНазначениеКт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
					И НоваяПроводка.НалоговоеНазначениеКт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					НоваяПроводка.СуммаНУКт = СтрокаТабличнойЧасти.СуммаНУ;
				КонецЕсли;
			КонецЕсли; 			
			
			Если НоваяПроводка.СчетДт.УчетПоНалоговымНазначениямНДС Тогда
				НоваяПроводка.НалоговоеНазначениеДт = СтрокаТабличнойЧасти.НалоговоеНазначение;
			КонецЕсли; 
			Если НоваяПроводка.СчетКт.УчетПоНалоговымНазначениямНДС Тогда
				НоваяПроводка.НалоговоеНазначениеКт = НалоговоеНазначениеДоходовИЗатрат;
			КонецЕсли;
						
		Иначе
			
			НоваяПроводка.СчетДт = Счет;
			БухгалтерскийУчет.УстановитьСубконто(Счет, НоваяПроводка.СубконтоДт, 1, Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Счет, НоваяПроводка.СубконтоДт, 2, Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Счет, НоваяПроводка.СубконтоДт, 3, Субконто3);
			
			НоваяПроводка.СчетКт = СтрокаТабличнойЧасти.СчетЗатрат;
			БухгалтерскийУчет.УстановитьСубконто(СтрокаТабличнойЧасти.СчетЗатрат, НоваяПроводка.СубконтоКт, 1, СтрокаТабличнойЧасти.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(СтрокаТабличнойЧасти.СчетЗатрат, НоваяПроводка.СубконтоКт, 2, СтрокаТабличнойЧасти.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(СтрокаТабличнойЧасти.СчетЗатрат, НоваяПроводка.СубконтоКт, 3, СтрокаТабличнойЧасти.Субконто3);
						
			Если НоваяПроводка.СчетДт.НалоговыйУчет Тогда
				НоваяПроводка.НалоговоеНазначениеДт = НалоговоеНазначениеДоходовИЗатрат;
				Если НоваяПроводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
					И НоваяПроводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					НоваяПроводка.СуммаНУДт = СтрокаТабличнойЧасти.СуммаНУ;
				КонецЕсли;
			КонецЕсли;
			Если НоваяПроводка.СчетКт.НалоговыйУчет Тогда
				НоваяПроводка.НалоговоеНазначениеКт = СтрокаТабличнойЧасти.НалоговоеНазначение;
				Если НоваяПроводка.НалоговоеНазначениеКт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
					И НоваяПроводка.НалоговоеНазначениеКт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
					НоваяПроводка.СуммаНУКт = СтрокаТабличнойЧасти.СуммаНУ;
				КонецЕсли;
			КонецЕсли;
						
			Если НоваяПроводка.СчетДт.УчетПоНалоговымНазначениямНДС Тогда
				НоваяПроводка.НалоговоеНазначениеДт = НалоговоеНазначениеДоходовИЗатрат;
			КонецЕсли; 
			Если НоваяПроводка.СчетКт.УчетПоНалоговымНазначениямНДС Тогда
				НоваяПроводка.НалоговоеНазначениеКт = СтрокаТабличнойЧасти.НалоговоеНазначение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИНАГРО_Общий.ИНАГРО_ДвиженияЗатратыОрганизации_Приход(СтруктураШапкиДокумента, Движения);
	
	СписокСчетов = ИНАГРО_Общий.ИНАГРО_СписокСчетовЗатрат();
	
	Если ВидОперации = Перечисления.ИНАГРО_ВидыОперацийПрочиеЗатраты.Списание Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ВЫБОР
		|		КОГДА &Счет В ИЕРАРХИИ (&Список)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Счет
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный";
		
		Запрос.УстановитьПараметр("Список", СписокСчетов);
		Запрос.УстановитьПараметр("Счет",   Счет);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если  Выборка.Счет = Ложь Тогда
				Инагро_ДвиженияЗатратыОрганизацииРасход(СтруктураШапкиДокумента, Движения, СписокСчетов);
			КонецЕсли;   
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ИНАГРО_ВидыОперацийПрочиеЗатраты.Отражение Тогда 
		// Если счет затрат (сч. Дт) не входит в список счетов затрат для распределения,
		// Тогда для движения Расход необходимо вызвать отдельную процедуру.
		Запрос = Новый Запрос;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ИНАГРО_ПрочиеЗатратыЗатраты.СчетЗатрат В ИЕРАРХИИ (&Список)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Счет
			|ИЗ
			|	Документ.ИНАГРО_ПрочиеЗатраты.Затраты КАК ИНАГРО_ПрочиеЗатратыЗатраты
			|ГДЕ
			|	ИНАГРО_ПрочиеЗатратыЗатраты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Список", СписокСчетов);
		Запрос.УстановитьПараметр("Счет",   Счет);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если  Выборка.Счет = Ложь Тогда
				Инагро_ДвиженияЗатратыОрганизацииРасход(СтруктураШапкиДокумента, Движения, СписокСчетов);
			КонецЕсли;   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура делает расход по регистру Затраты Организации. Тот случай когда нужно списать с затратного счета.
Процедура Инагро_ДвиженияЗатратыОрганизацииРасход(СтруктураШапкиДокумента, Движения, СписокСчетов)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	ХозрасчетныйДвиженияССубконто.Период,
		|	ХозрасчетныйДвиженияССубконто.Регистратор,
		|	ХозрасчетныйДвиженияССубконто.НомерСтроки,
		|	ХозрасчетныйДвиженияССубконто.Активность,
		|	ХозрасчетныйДвиженияССубконто.СчетДт,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.СтатьиЗатрат
		|			ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.СтатьиЗатрат
		|					ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.СтатьиЗатрат
		|							ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт3
		|						ИНАЧЕ NULL
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатьяЗатрат,
		|	ХозрасчетныйДвиженияССубконто.ВидСубконтоДт1,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.ПодразделенияОрганизаций
		|			ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.ПодразделенияОрганизаций
		|					ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.ПодразделенияОрганизаций
		|							ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт3
		|						ИНАЧЕ NULL
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Подразделение,
		|	ХозрасчетныйДвиженияССубконто.ВидСубконтоДт2,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.НоменклатурныеГруппы
		|			ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.НоменклатурныеГруппы
		|					ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.НоменклатурныеГруппы
		|							ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт3
		|						ИНАЧЕ NULL
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК НоменклатурнаяГруппа,
		|	ХозрасчетныйДвиженияССубконто.ВидСубконтоДт3,
		|	ХозрасчетныйДвиженияССубконто.СчетКт,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт1,
		|	ХозрасчетныйДвиженияССубконто.ВидСубконтоКт1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт2,
		|	ХозрасчетныйДвиженияССубконто.ВидСубконтоКт2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт3,
		|	ХозрасчетныйДвиженияССубконто.ВидСубконтоКт3,
		|	ХозрасчетныйДвиженияССубконто.Организация,
		|	ХозрасчетныйДвиженияССубконто.ВалютаДт,
		|	ХозрасчетныйДвиженияССубконто.ВалютаКт,
		|	ХозрасчетныйДвиженияССубконто.Сумма,
		|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаДт,
		|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаКт,
		|	ХозрасчетныйДвиженияССубконто.КоличествоДт,
		|	ХозрасчетныйДвиженияССубконто.КоличествоКт,
		|	ХозрасчетныйДвиженияССубконто.Содержание,
		|	ХозрасчетныйДвиженияССубконто.НомерЖурнала,
		|	ХозрасчетныйДвиженияССубконто.СчетДополнительный,
		|	ХозрасчетныйДвиженияССубконто.НеКорректироватьСтоимостьАвтоматически,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйДвиженияССубконто.СчетКт В ИЕРАРХИИ (&СписокСчетовЗатрат)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РасходЗатрат,
		|	ХозрасчетныйДвиженияССубконто.СуммаНУДт,
		|	ХозрасчетныйДвиженияССубконто.СуммаНУКт,
		|	ХозрасчетныйДвиженияССубконто.НалоговоеНазначениеДт,
		|	ХозрасчетныйДвиженияССубконто.НалоговоеНазначениеКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , Регистратор = &Ссылка, , ) КАК ХозрасчетныйДвиженияССубконто
		|ГДЕ
		|	ХозрасчетныйДвиженияССубконто.СчетКт В ИЕРАРХИИ(&СписокСчетовЗатрат)"; 
	
	Запрос.УстановитьПараметр("Ссылка",             СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("СписокСчетовЗатрат", СписокСчетов);
	
	ВыборкаЗатрат = Запрос.Выполнить().Выбрать();
	
	ПустаяНомГруп = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
	ПустоеПодразд = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	ПустаяСтатья  = Справочники.СтатьиЗатрат.ПустаяСсылка();
	
	Пока ВыборкаЗатрат.Следующий() Цикл
		
		Движение = Движения.ИНАГРО_ЗатратыОрганизаций.Добавить();		
		Движение.ВидДвижения 	                   = ВидДвиженияНакопления.Расход;
		Движение.Период 		                   = ВыборкаЗатрат.Период;
		Движение.Организация 	                   = ВыборкаЗатрат.Организация;		
		Движение.СчетЗатрат 		               = ВыборкаЗатрат.СчетКт;
		Движение.Подразделение 		               = ВыборкаЗатрат.Подразделение;
		Движение.НоменклатурнаяГруппа              = ВыборкаЗатрат.НоменклатурнаяГруппа;
		Движение.СтатьяЗатрат 		               = ВыборкаЗатрат.СтатьяЗатрат; 		
		Движение.Количество 		               = ВыборкаЗатрат.КоличествоКт;
		Движение.Сумма 				               = ВыборкаЗатрат.Сумма;		
		Движение.СуммаНУ                           = ВыборкаЗатрат.СуммаНУДт;
		Движение.НалоговоеНазначениеДоходовИЗатрат = ВыборкаЗатрат.НалоговоеНазначениеКт; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
